<!DOCTYPE html>

<html>
<head>
    <title>Digicenosis - Naturaleza Digital: Anotaciones</title>
    <?php include '../units/metatag.php'; ?>
    <link href='../estilo.css' rel='stylesheet' type='text/css'>
    <script src="../cderecho.js" language="javascript"></script>
    <script src="../jquery.min.js" language="javascript" type="text/javascript"></script>
    <link rel="icon" type="image/x-icon" href="../img/favicon.ico" />
    </head>
    <body>
    <div id="no-ie" class="fijo no-mostrar">Digicenosis puede no funcionar correctamente en su navegador. Descargue <a href="http://www.mozilla.org/firefox" target="_blank" style="color:#ccc;text-decoration:underline;">Mozilla Firefox</a></div>
    <div id="contenedor" class="fijo">
        <div id="header_2" class="absoluta">
            <h2><a href="../index.html">Digicenosis</a></h2>
            <p>Naturaleza Digital <span class="titl">[No tan]</span> Muerta</p>
        </div>
        <img src="../img/libro.jpg" class="imgi absoluta" />
        <img src="../img/cinta.png" class="cinta1 absoluta" />
        <img src="../img/cinta.png" class="cinta2 absoluta" width="60" />
        <img src="../img/linea.png" class="separador absoluta" />
        <h3 class="titulo_anotaciones absoluta">Anotaciones</h3>
        <h4 class="titulo_registro absoluta">Registros</h4>
        <div id="especies_lista" class="absoluta">
            <ul>
                <li><a href="#" class="res_1">1 de Abril</a></li>
                <li><a href="#" class="res_2">5 de Abril</a></li>
                <li><a href="#" class="res_3">13 de Mayo</a></li>
                <li><a href="#" class="res_4">2 de Junio</a></li>
            </ul>
        </div>
        <div class="conteto_2 1_abril absoluta">
            <h4>1 de Abril</h4>
            <p>Temprano, me encontraba programando un sistema donde se almacenan simples coordenadas. El software funcionaba sin inconvenientes, no obstante, transcurridos unos minutos, se present&oacute; una anomal&iacute;a. Las coordenadas cobraron "vida". S&iacute;, aunque suene il&oacute;gico o delirante, las coordenadas se ubicaron en determinadas posiciones, dando origen a un peque&ntilde;o organismo.</p>
            <p>No puedo comprender el "por qu&eacute;" de la situaci&oacute;n. Simplemente comienzo a pensar el problema como un mero sistema, un ecosistema digital, donde nacen criaturas por interactuar con cualquier dispositivo de entrada (mouse, teclado, etc...).</p>
        </div>
        <div class="conteto_2 5_abril absoluta no-mostrar">
            <h4>5 de Abril</h4>
            <p>Comenc&eacute; a investigar un poco m&aacute;s a fondo lo ocurrido. Al parecer son seres de vida bastante corta. Algunos organismos tienen una esperanza de vida m&aacute;s elevada que otros, pero todos perecen en alg&uacute;n momento.</p>
            <p>Tambi&eacute;n he notado que al ingresar coordenadas con el bot&oacute;n auxiliar del cursor se crean unos organismos mucho m&aacute;s sencillos que el resto, incluso en su programaci&oacute;n. He decidido considerarlos una especie de planta o bacteria, ya que las criaturas parecen alimentarse de ellas.</p>
        </div>
        <div class="conteto_2 13_mayo absoluta no-mostrar">
            <h4>13 de Mayo</h4>
            <p>Esto es Fascinante! Estaba en lo correcto, los seres digitales se alimentan de esas bacterias, pero tambi&eacute;n pueden producirles una intoxicaci&oacute;n muy severa.</p>
            <p>Cada ser tiene sus caracter&iacute;sticas, si bien hay algunos muy vulnerables a la bacteria, otros disfrutan aliment&aacute;ndose de ella, y hay algunos que simplemente la evitan.</p>
            <p>Al parecer hay una buena cantidad de criaturas, pero solo una clase de planta/bacteria. No obstante, esta misma posee diferentes propidades al momento de su creaci&oacute;n.</p>
        </div>
        <div class="conteto_2 2_junio absoluta no-mostrar">
            <h4>2 de Junio</h4>
            <p>Me encontraba tan impactado con los seres, que no not&eacute; que se estaba sobrepoblando. Por mucho que me duela, tuve que instalar un sistema para reiniciar el ambiente y limpiarlo de criaturas.</p>
            <p>De esta forma, le asign&eacute; la tarea a la barra de espacio. Al oprimirla, se suelta una especie de mini-bomba que acaba con todo ser vivo dentro del ecosistema.</p>
            <p>As&iacute;mismo, desarroll&eacute; la funci&oacute;n ENTER. Consiste en conseguir una captura del ecosistema en cualquier momento. La tarea es de la tecla enter/intro.</p>
        </div>
    </div>
    <div id="nav" class="fijo">
        <ul>
            <li id="p01" class="absoluta"><a href="../ecosistemas/index.html"><span>Ecosistemas</span></a></li>
            <li id="p02" class="absoluta"><a href="../flora_fauna/index.html"><span>Flora-Fauna</span></a></li>
            <li id="p03" class="absoluta"><a href="#"><span>Anotaciones</span></a></li>
        </ul>
    </div>
<div id="pie" class="fijo sombra_2">
<p class="absoluta"><a href="http://pyrlo.com.ar" target="_blank">Ignacio Buioli</a></p>
</div>
<div class="fijo" id="pexen"></div>
<div class="fijo" id="belga"></div>
<div class="fijo" id="oxel"></div>
<script src="../sprites.js" language="javascript" type='text/javascript'></script>
<script src="../programa.js" language="javascript" type="text/javascript"></script>
</body>
</html>